app/Controllers/Admin/ProductController.php

SELECT *
FROM `products`
ORDER BY `created_at` DESC
---
    public function index()
    {
        return view('admin/products/index', [
            'title' => 'Admin Products',
            'products' => (new ProductModel())->orderBy('created_at', 'DESC')->findAll(),

SELECT *
FROM `products`
WHERE `products`.`id` = 7
---
    public function edit(int $id)
    {
        $product = (new ProductModel())->find($id);

SELECT *
FROM `products`
WHERE `products`.`id` = 7
UPDATE `products` SET `name` = 'ATLAS Lite Ultralight Wireless Ergo Gaming Mouse', `description` = 'ATLAS Lite Ergonomic Ultralight Wireless Ergo Gaming Mouse by Press Play', `price` = 249000, `stock` = 35, `image` = '1777548998_6018d7dbdc0b01dc3a85.jpeg', `updated_at` = '2026-04-30 18:36:38'
WHERE `products`.`id` IN (7)
---
    public function update(int $id)
    {
        $model = new ProductModel();
        $product = $model->find($id);
        if (! $product) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Product not found');
        }

        $data = $this->validatedData();
        if ($data === null) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $image = $this->uploadImage(false);
        if ($image !== null) {
            $data['image'] = $image;
            $this->deleteImage($product['image']);
        }

        $model->update($id, $data);