app/Controllers/HomeController.php

SELECT *
FROM `products`
ORDER BY `created_at` DESC
 LIMIT 6
---
    public function index()
    {
        $products = (new ProductModel())
            ->orderBy('created_at', 'DESC')
            ->limit(6)
            ->find();