app/Controllers/ProductController.php

    public function index()
    {
        $q = trim((string) $this->request->getGet('q'));
        $model = new ProductModel();

        if ($q !== '') {
            $model->groupStart()
                ->like('name', $q)
                ->orLike('description', $q)
                ->groupEnd();
        }

        return view('products/index', [
            'title'    => 'Elite Collection',
            'products' => $model->orderBy('created_at', 'DESC')->findAll(),
---
SELECT *
FROM `products`
ORDER BY `created_at` DESC